# DATA WRANGLING

In [1]:
import numpy as  np 
import pandas as pd

In [ ]:
df=pd.DataFrame([["Shahid",80],["Anas",75]],columns=["Name","Marks"])
df

In [ ]:
df2=pd.DataFrame([["Akshay",70],["Sonal",92]],columns=["Name","Marks"])
df2

In [ ]:
outer_merge=pd.merge(df,df2,on="Name",how="outer")
outer_merge

In [ ]:
inner_df=pd.merge(df,df2,on="Name",how="inner")
inner_df
# because none of the dataframes have no common values it returns no rows

In [ ]:
concat=pd.concat([df,df2],ignore_index=True)

concat

In [ ]:
newdf=pd.DataFrame([["UPESUNIVERSITY","DEHRADUN","OKAY"],["DIT UNIVERSITY","DEHRADUN","OKAY"],["AMITY UNIVERSITY","DELHI","BAD"],["JNU","DELHI","GOOD"]] ,columns=["University","City","Remark"])
newdf

In [ ]:
newdf2=pd.DataFrame([["Graphic Era","DEHRADUN","OKAY"],["AMU","ALIGARH","OKAY"],["WOXEN UNIVERSITY","HYDERABAD","BAD"],["APJ ABDUL KALAM","LUCKNOW","GOOD"]] ,columns=["University","City","Remark"])
newdf2

In [ ]:
universities=pd.merge(newdf,newdf2,on='City',how='left')
universities

In [ ]:
universities.rename(columns={'University_x':"Primary University",'University_y':"Partner University",'Remark_x': 'Primary_Status'},inplace='True')

In [ ]:
universities

In [ ]:
city_counts=universities.groupby('City')['Primary University'].count()
city_counts
#checking number of universities in each column

In [ ]:
data = {
    'Order_ID': [101, 102, 103, 104, 105, 106, 107, 108],
    'Customer_Name': ['Shahid', ' Anas ', 'Akshay', 'Sonal', 'shahid', 'Anas', 'Zara', 'Amir'],
    'City': ['Dehradun', 'Delhi', 'DEHRADUN', 'Noida', 'Dehradun', 'delhi', 'Mumbai', np.nan],
    'Product': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Mouse', 'Keyboard', 'Laptop', 'Monitor'],
    'Price': [85000, 1200, 15000, 85000, 1200, 5000, 90000, 15000],
    'Quantity': [1, 2, 1, 1, 3, 2, 1, np.nan],
    'Order_Date': ['2024-01-01', '02-01-2024', '2024/01/03', '2024-01-04', '2024-01-05', '06-01-2024', '2024-01-07', '2024-01-08']
}

df_sales = pd.DataFrame(data)
print("--- Messy Sales Database Created ---")
print(df_sales.head(8))

In [ ]:
# str.strip() removes white spaces from beginning and end of a string
df_sales['Customer_Name']=df_sales['Customer_Name'].str.strip().str.capitalize()
df_sales

In [ ]:
df_sales=df_sales.dropna()
df_sales

In [ ]:
df_sales['City']=df_sales['City'].str.upper()
df_sales

In [22]:
pd.to_datetime(df_sales['Order_Date'],format='mixed',dayfirst='True')

0   2024-01-01
1   2024-01-02
2   2024-01-03
3   2024-01-04
4   2024-01-05
5   2024-01-06
6   2024-01-07
Name: Order_Date, dtype: datetime64[ns]

In [5]:
data = {
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-01', '2024-01-02', '2024-01-03', '2024-01-03'],
    'Salesman': ['Shahid', 'Anas', 'Shahid', 'Anas', 'Akshay', 'Akshay', 'Sonal', 'Sonal'],
    'Region': ['North', 'North', 'North', 'North', 'South', 'South', 'West', 'West'],
    'Item': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Monitor', 'Mouse', 'Laptop', 'Monitor'],
    'Units': [5, 10, 2, 7, 3, 15, 4, 8],
    'Price_Per_Unit': [80000, 1500, 12000, 80000, 12000, 1500, 85000, 11000]
}

In [6]:
df_pivot = pd.DataFrame(data)
df_pivot

         Date Salesman Region     Item  Units  Price_Per_Unit
0  2024-01-01   Shahid  North   Laptop      5           80000
1  2024-01-01     Anas  North    Mouse     10            1500
2  2024-01-02   Shahid  North  Monitor      2           12000
3  2024-01-02     Anas  North   Laptop      7           80000
4  2024-01-01   Akshay  South  Monitor      3           12000
5  2024-01-02   Akshay  South    Mouse     15            1500
6  2024-01-03    Sonal   West   Laptop      4           85000
7  2024-01-03    Sonal   West  Monitor      8           11000

In [7]:
df_pivot.pivot_table(values=["Units","Price_Per_Unit"],columns='Salesman')

Salesman        Akshay     Anas   Shahid    Sonal
Price_Per_Unit  6750.0  40750.0  46000.0  48000.0
Units              9.0      8.5      3.5      6.0

In [8]:
df_pivot["Total_revenue"]=df_pivot['Units']*df_pivot['Price_Per_Unit']

In [9]:
df_pivot.pivot_table(values=["Units","Price_Per_Unit","Total_revenue"],columns='Salesman')

Salesman         Akshay      Anas    Shahid     Sonal
Price_Per_Unit   6750.0   40750.0   46000.0   48000.0
Total_revenue   29250.0  287500.0  212000.0  214000.0
Units               9.0       8.5       3.5       6.0

In [11]:
ad_pivot=df_pivot.pivot_table(index='Salesman',values=['Units','Price_Per_Unit','Total_revenue'],aggfunc={'Units':'sum','Total_revenue':'mean'})
ad_pivot

          Total_revenue  Units
Salesman
Akshay          29250.0     18
Anas           287500.0     17
Shahid         212000.0      7
Sonal          214000.0     12